postman-data-extension-templates/RMOT

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <Header>
        <Action>Create</Action>
        <To>https://{{subdomain}}.soap.marketingcloudapis.com/Service.asmx</To>
        <fueloauth xmlns="http://exacttarget.com">{{dne_etAccessToken}}</fueloauth>
    </Header>
    <Body>
        <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
            <Options></Options>
            <Objects xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI" xsi:type="ns1:DataExtension">
                <CustomerKey>All mailable Leads NO Japan</CustomerKey>
                <Name>All mailable Leads NO Japan</Name>
                <IsSendable>true</IsSendable>
                <SendableDataExtensionField>
                    <Name>LeadOrContactId</Name>
                    <FieldType>Text</FieldType>
                </SendableDataExtensionField>
                <SendableSubscriberField>
                    <Name>Subscriber Key</Name>
                    <Value></Value>
                </SendableSubscriberField>
                <Fields>
                    <Field>
                        <Name>LeadOrContactId</Name>
                        <FieldType>Text</FieldType>
                        <IsRequired>true</IsRequired>
                        <IsPrimaryKey>true</IsPrimaryKey>
                        <MaxLength>18</MaxLength>
                    </Field>
                    <Field>
                        <Name>ConvertedContactId</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>18</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Object</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>10</MaxLength>
                    </Field>                                          
                    <Field>
                        <Name>FirstName</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>40</MaxLength>
                    </Field>  
                    <Field>
                        <Name>LastName</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>80</MaxLength>
                    </Field>  
                    <Field>
                        <Name>Email</Name>
                        <FieldType>EmailAddress</FieldType>
                    </Field>  
                    <Field>
                        <Name>Region__c</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>15</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Country</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>2</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Language</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>100</MaxLength>
                    </Field>                     
                    <Field>
                        <Name>Segment__c</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>1000</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Segment</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>100</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Job_Profile__c</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>1000</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Path</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>1000</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Futureforce__c</Name>
                        <FieldType>Boolean</FieldType>
                    </Field>
                    <Field>
                        <Name>Confidential_Text__c</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>5</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Marketing_Opt_In__c</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>255</MaxLength>
                    </Field>                                              
                    <Field>
                        <Name>Recruiting_Opt_In__c</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>255</MaxLength>
                    </Field>                                              
                    <Field>
                        <Name>Last_Interaction_Date__c</Name>
                        <FieldType>Date</FieldType>
                    </Field>                                              
                    <Field>
                        <Name>Initial_Interaction_Date__c</Name>
                        <FieldType>Date</FieldType>
                    </Field>                                              
                    <Field>
                        <Name>LeadSource</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>255</MaxLength>
                    </Field> 
                    <Field>
                        <Name>Days_Since_Last_Interaction</Name>
                        <FieldType>Number</FieldType>
                    </Field> 
                    <Field>
                        <Name>Task_Subject</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>255</MaxLength>
                    </Field>  
                    <Field>
                        <Name>Most_Recently_Submitted_Application_ID</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>18</MaxLength>
                    </Field>  
                    <Field>
                        <Name>Application_Date__c</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>Disposition_Reason_Date__c</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>Record_Type</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>100</MaxLength>
                    </Field>                      
                                                                              
                </Fields>
            </Objects>
        </CreateRequest>
    </Body>
</Envelope>
